# CenterlineLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..CenterlineLength Property
FabricationPart Class See Also
---
The centerline length of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public double CenterlineLength { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CenterlineLength As Double
	Get
```

Visual C++
---
```text
public:
property double CenterlineLength {
	double get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace